In [1]:

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import string as string
from sqlalchemy import create_engine
csv_path = "./poverty.csv"
poverty_df = pd.read_csv(csv_path)
poverty_df.head()

    Entity Code  Year  Percentage
0  Albania  ALB  1996       12.36
1  Albania  ALB  2002       16.61
2  Albania  ALB  2005        9.79
3  Albania  ALB  2008        6.11
4  Albania  ALB  2012        6.79

In [2]:
from sqlalchemy import create_engine
connection_string = "mzedobeawmveaa:6988c0251dcc5057de82f185f796d31c7a7d58a94c7245ffa687ed1db2d41cfc@ec2-107-21-226-44.compute-1.amazonaws.com:5432/di0rlcvvaevqo"
engine = create_engine(f'postgresql://{connection_string}')

In [4]:
engine.table_names()

['poverty']